<?php

$text = "У дома очень большой двор. Тропинка от дома ведет к клумбам. В саду у дома есть деревья,недавно я сделал(а) к нему скворечник.
Что бы зайти в дом,нужно отпереть ворота. Рядом с домом стоит гараж. Крыша у дома ну очень красивая.
За городом я увидел(а) рядом с домом бассейн. Моя подруга пригласила к себе в дом. В доме три этажа по девять квартир.
Богатые люди строят себе очень красивые и большие дома с садами,басейнами.";

$mas = array(
    "А" => "а", "Б" => "б", "В" => "в", "Г" => "г", "Д" => "д", "Е" => "е",
    "Ё" => "ё", "Ж" => "ж", "З" => "з", "И" => "и", "Й" => "й", "К" => "к",
    "Л" => "л", "М" => "м", "Н" => "н", "О" => "о", "П" => "п", "Р" => "р",
    "С" => "с", "Т" => "т", "У" => "у", "Ф" => "ф", "Х" => "х", "Ц" => "ц",
    "Ч" => "ч", "Ш" => "ш", "Щ" => "щ", "Ъ" => "ъ", "Ь" => "ь", "Э" => "э",
    "Ю" => "ю", "Я" => "я"
);
$text_low = strtr($text,$mas);//Замена больших букв на маленькие
$delete = str_replace(array("\r\n", "\r", "\n", ".", ","),"", $text_low);//Удаляем пробелы между слов и другие и перевода каретки

$result = explode(" ", $delete);
print_r(array_count_values($result));

$word = count($result);
echo "Всего слов = ", $word;